if [ -d ~/.config/hyprdots/settings ]; then
  echo -e "${GREEN}"
  cat <<"EOF"
 ____  ____  ____  ____  ____   __   ____  ____  _  _  ____  __ _   __
 ____   __    ___  ___  ____  __   _  _   __  ____   __   ____  _  _  _ __  ____
(  _ \ /  \  / __)/ __)(_  _)/ _\ / )( \ /  \(  _ \ /  \ (  __)/ )( \/ )  )(  __)
 ) _ ((  O )( (__( (__   )( /    \) __ ((  O )) _ (/ /\ \ ) _) ) __ (\    \ ) _)
(____/ \__/  \___)\___) (__)\_/\_/\_)(_/ \__/(____/\_)(_/(____)\_)(_/(__(_/(____)
EOF
  echo -e "${NONE}"
  echo ":: Скрипт обнаружил существующую папку с настройками."
  if gum confirm "Хотите восстановить настройки?"; then
    cp -r ~/.config/hyprdots/settings/. ~/hyprdots/$version/.config/hyprdots/settings/
  elif [ $? -eq 130 ]; then
    echo ":: Установка отменена"
    exit
  else
    echo ":: Восстановление пропущено"
  fi
fi

